Codigo para leitura do dataset

In [2]:
import pandas as pd

In [9]:
df_total = pd.read_csv('datasets/tempo_salarios.csv')

In [10]:
df_total.head()

   AnosdeExperiencia  Salario
0                1.1  39343.0
1                1.3  46205.0
2                1.5  37731.0
3                2.0  43525.0
4                2.2  39891.0

In [11]:
df_total.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   AnosdeExperiencia  30 non-null     float64
 1   Salario            30 non-null     float64
dtypes: float64(2)
memory usage: 612.0 bytes

In [16]:
print(f"Qtd linhas: {len(df_total)}")

Qtd linhas: 30